src/InformationRegisters/УстановленныеРасширенияКонфигураций/УстановленныеРасширенияКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеРасширенияКонфигураций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииРасширенийКонфигураций</types>
    </type>
  </resources>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХешСумма</name>
    <comment>SHA-1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияРасширений</types>
    </type>
  </resources>
  <resources>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Модифицировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасширениеКонфигурации</name>
    <type>
      <types>CatalogRef.РасширенияКонфигураций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/HTTPРасширенияБазы/Module.bsl
Процедура ВалидироватьЗапрос(ТелоСообщения, ОбязательныеПоля) Экспорт
	
	Если ПустаяСтрока(ТелоСообщения) Тогда
		ВызватьИсключение "Тело запроса пустое";		
	КонецЕсли;
	
	Попытка
		Данные = ОбщегоНазначения.JSONВЗначение(ТелоСообщения,, Ложь);
	Исключение
		ВызватьИсключение "Ошибка парсинга JSON" + ОписаниеОшибки();	
	КонецПопытки;
	
	Если Данные = Неопределено Тогда
		ВызватьИсключение "Ошибка парсинга JSON";
	КонецЕсли;
	
	Для Каждого Поле Из ОбязательныеПоля Цикл
		Если Не Данные.Свойство(Поле) Тогда
			ВызватьИсключение "Отсутствует обязательное поле: " + Поле;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 
 
 Функция ПолучитьИнформациюПоРасширениям(ИдентификаторИБ) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеРасширенияКонфигурацииСрезПоследних.РасширениеКонфигурации.Наименование КАК РасширениеКонфигурации
		|ИЗ
		|	РегистрСведений.УстановленныеРасширенияКонфигураций.СрезПоследних(, ИнформационнаяБаза.ИдентификаторИБ = &ИдентификаторИБ) КАК УстановленныеРасширенияКонфигурацииСрезПоследних
		|ГДЕ
		|	НЕ УстановленныеРасширенияКонфигурацииСрезПоследних.Исключить";
	
	Запрос.УстановитьПараметр("ИдентификаторИБ", ИдентификаторИБ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	МассивРасширений = Новый Массив;
	
	Пока РезультатЗапроса.Следующий()цикл
		
		МассивРасширений.Добавить(РезультатЗапроса.РасширениеКонфигурации); 
		
	конецЦикла; 

	Возврат МассивРасширений;
	
КонецФункции

Функция КонструкторОбязательныхПолейПостроке(Строка) Экспорт

	Возврат СтрРазделить(Строка,",", Ложь);
	
КонецФункции
